export const availableItems = [
    {
        name: "プレート類"
    },
    {
        name: "いのちのたま"
    },
    {
        name: "こだわりハチマキ"
    },
    {
        name: "こだわりメガネ"
    },
    {
        name: "こころのしずく"
    },
    {
        name: "こんごうだま"
    },
    {
        name: "しらたま"
    },
    {
        name: "しんかいのきば"
    },
    {
        name: "たつじんのおび"
    },
    {
        name: "ちからのハチマキ"
    },
    {
        name: "でんきだま"
    },
    {
        name: "ふといホネ"
    },
    {
        name: "ものしりメガネ"
    },
    {
        name: "メトロノーム(2回目*1.2)"
    },
    {
        name: "メトロノーム(3回目*1.4)"
    },
    {
        name: "メトロノーム(4回目*1.6)"
    },
    {
        name: "メトロノーム(5回目*1.8)"
    },
    {
        name: "メトロノーム(6回目以降*2)"
    },
]