export interface Item {
    name: string;
}

export const availableItems: Item[] = [
    {name: "なし"},
    {
        name: "プレート類"
    },
    {
        name: "いのちのたま"
    },
    {
        name: "こだわりハチマキ"
    },
    {
        name: "こだわりメガネ"
    },
    {
        name: "こころのしずく"
    },
    {
        name: "こんごうだま"
    },
    {
        name: "しらたま"
    },
    {
        name: "しんかいのきば"
    },
    {
        name: "たつじんのおび"
    },
    {
        name: "ちからのハチマキ"
    },
    {
        name: "でんきだま"
    },
    {
        name: "ふといホネ"
    },
    {
        name: "ものしりメガネ"
    },
    {
        name: "メトロノーム(2回目*1.2)"
    },
    {
        name: "メトロノーム(3回目*1.4)"
    },
    {
        name: "メトロノーム(4回目*1.6)"
    },
    {
        name: "メトロノーム(5回目*1.8)"
    },
    {
        name: "メトロノーム(6回目以降*2)"
    },
]

export const AllItem: Item[] = [
    {name: "なし"},
    {name:"あいいろのたま"},
    {name:"あおいバンダナ"},
    {name:"あおぞらプレート"},
    {name:"あかいいと"},
    {name:"あかいバンダナ"},
    {name:"あついいわ"},
    {name:"いかずちプレート"},
    {name:"イナズマカセット"},
    {name:"いのちのたま"},
    {name:"うしおのおこう"},
    {name:"おうじゃのしるし"},
    {name:"おおきなねっこ"},
    {name:"おまもりこばん"},
    {name:"かえんだま"},
    {name:"かたいいし"},
    {name:"かるいし"},
    {name:"かわらずのいし"},
    {name:"がんせきプレート"},
    {name:"きあいのタスキ"},
    {name:"きあいのハチマキ"},
    {name:"きいろバンダナ"},
    {name:"きせきのタネ"},
    {name:"きちょうなホネ"},
    {name:"きゅうこん"},
    {name:"きょうせいギプス"},
    {name:"きよめのおふだ"},
    {name:"くっつきバリ"},
    {name:"くろいてっきゅう"},
    {name:"くろいヘドロ"},
    {name:"くろいメガネ"},
    {name:"くろおび"},
    {name:"けむりだま"},
    {name:"こううんのおこう"},
    {name:"こうかくレンズ"},
    {name:"こうこうのしっぽ"},
    {name:"こうてつプレート"},
    {name:"こだわりスカーフ"},
    {name:"こだわりハチマキ"},
    {name:"こだわりメガネ"},
    {name:"ゴツゴツメット"},
    {name:"こぶしのプレート"},
    {name:"こわもてプレート"},
    {name:"こんごうだま"},
    {name:"コンテストパス"},
    {name:"さざなみのおこう"},
    {name:"さらさらいわ"},
    {name:"しあわせタマゴ"},
    {name:"じしゃく"},
    {name:"しずくプレート"},
    {name:"しめつけバンド"},
    {name:"しめったいわ"},
    {name:"じゃくてんほけん"},
    {name:"じゅうでんち"},
    {name:"しらたま"},
    {name:"シルクのスカーフ"},
    {name:"しろいハーブ"},
    {name:"しんかのきせき"},
    {name:"しんぴのしずく"},
    {name:"スピードパウダー"},
    {name:"するどいキバ"},
    {name:"するどいくちばし"},
    {name:"するどいツメ"},
    {name:"せいれいプレート"},
    {name:"せんせいのツメ"},
    {name:"だいちのプレート"},
    {name:"だっしゅつボタン"},
    {name:"たつじんのおび"},
    {name:"たべのこし"},
    {name:"たまむしプレート"},
    {name:"ちからのハチマキ"},
    {name:"つめたいいわ"},
    {name:"つららのプレート"},
    {name:"でんきだま"},
    {name:"どくどくだま"},
    {name:"どくバリ"},
    {name:"とけないこおり"},
    {name:"とつげきチョッキ"},
    {name:"ながねぎ"},
    {name:"ねばりのかぎづめ"},
    {name:"ねらいのまと"},
    {name:"ノーマルジュエル"},
    {name:"のろいのおふだ"},
    {name:"のんきのおこう"},
    {name:"はっきんだま"},
    {name:"パワーアンクル"},
    {name:"パワーウェイト"},
    {name:"パワーバンド"},
    {name:"パワーベルト"},
    {name:"パワーリスト"},
    {name:"パワーレンズ"},
    {name:"パワフルハーブ"},
    {name:"ひかりごけ"},
    {name:"ひかりのこな"},
    {name:"ひかりのねんど"},
    {name:"ひのたまプレート"},
    {name:"ピンクのバンダナ"},
    {name:"ピントレンズ"},
    {name:"ふうせん"},
    {name:"フォーカスレンズ"},
    {name:"ふしぎのプレート"},
    {name:"ふといホネ"},
    {name:"フリーズカセット"},
    {name:"ブレイズカセット"},
    {name:"べにいろのたま"},
    {name:"ぼうじんゴーグル"},
    {name:"まがったスプーン"},
    {name:"みどりのバンダナ"},
    {name:"みどりのプレート"},
    {name:"メタルパウダー"},
    {name:"メトロノーム"},
    {name:"メンタルハーブ"},
    {name:"もうどくプレート"},
    {name:"もくたん"},
    {name:"ものしりメガネ"},
    {name:"もののけプレート"},
    {name:"やすらぎのすず"},
    {name:"やわらかいすな"},
    {name:"ゆきだま"},
    {name:"ラッキーパンチ"},
    {name:"りゅうのキバ"},
    {name:"りゅうのプレート"},
    {name:"レッドカード"},
    {name:"ビビリだま"},
    {name:"ぼうごパッド"},
    {name:"グランドコート"},
    {name:"グラスシード"},
    {name:"ミストシード"},
    {name:"サイコシード"},
    {name:"エレキシード"}
]